{
    "My name is Leonardo. I'm a programmer from São Paulo, Brazil, currently living in Portugal and completing my graduation." : "Chamo-me Leonardo. Sou programador de São Paulo, Brasil, e atualmente estou a viver em Portugal a concluir a minha graduação.",
    "I have a job at an influential programming company in Portugal, and I'm planning to continue my studies." : "Tenho um emprego numa empresa influente de programação em Portugal e pretendo continuar os meus estudos.",
    "I am familiar with several programming languages, and I can easily learn new ones. I enjoy learning new design patterns and implementing them in my projects." : "Conheço várias linguagens de programação e posso aprender facilmente uma nova. Gosto de aprender novos padrões de desenho e utilizá-los nos meus projetos.",
    "In the future, I hope to enhance my programming knowledge through work experience, and I am also planning to move to another country to improve my English skills." : "No futuro, espero aprimorar os meus conhecimentos de programação através do trabalho e também estou a planear mudar-me para outro país para melhorar o meu inglês.",

    "Hello World": "Olá Mundo",
    "About": "Sobre",
    "Projects": "Projetos",
    "Curriculum": "Currículo",
    "Chess": "Xadrez",
    "Main Projects:": "Projetos principais:",
    "My name is Leonardo": "Meu nome é Leonardo",
    
    "Gym": "Ginásio",
    "Going to the gym has become a very important part of my life, a place of socializing for people who strive for a better and healthier lifestyle through effort.": "Ir ao ginásio se tornou uma parte muito importante da minha vida, um lugar de convívio de pessoas que buscam atravéz do esforço um estilo de vida melhor e mais saldável.",
    "There is no easy way to achieve gains, there are no better or worse ones, there are only those who are more hardworking and consistent.": "Não há jeito fácil de conseguir ganhos, não há melhores ou piores, há apenas mais esforçados e mais consistentes.",
    "This lifestyle demands more effort, is more painful, and requires more energy, but seeing how my body improves in terms of strength and aesthetics is priceless.": "Esse estilo de vida exige mais esforço, é mais doloroso e exige mais energia, mas ver como meu corpo melhora no quesito força e estética não tem preço.",
    
    "Music": "Música",
    "Music has been an important part of my life since forever.": "Música é parte importante da minha vida desde sempre.",
    "I grew up listening to classic Brazilian and foreign music. Wherever I go, I carry headphones with me and several downloaded songs.": "Cresci ouvindo músicas clássicas brasileiras e extrangeiras, onde quer que eu vá carrego um fone de ouvido comigo e várias músicas baixadas.",
    "My favorite music genres are pop, rock, and jazz, and almost anything that originates from them. I have an open mind to new bands and new styles.": "Meus estilos preferidos de música são músicas POP, Rock e Jazz, e quase tudo que se origina daí. Tenho mente aberta a novas bandas e novos estilos.",
    "The Weeknd, Lana Del Rey, Pink Floyd, The Alan Parsons Project, Tyler, The Creator, and Arctic Monkeys are always among the most played songs of the day.": "The weeknd, Lana del Rey, Pink Floyd, The Alon Parsons Project, Tyler The Creator e Artic Monkeys estão sempre nas mais tocadas do dia.",
    
    "Travel": "Viajar",
    "But if I had to choose one, my favorite hobby is definitely traveling.": "Mas se fosse para escolher um, meu hobbie preferido com certeza é viajar.",
    "I enjoy everything about traveling, from planning the flights and packing my suitcase to the feeling of leaving the house locked up. I love the excitement of arriving at the airport, the journey on the plane, and immersing myself in a new culture in a new country with new sights and cuisine.": "Eu gosto de tudo sobre viajem, planear os voos, preparar a mala, o sentimento de deixar a casa fechada, a chegada no aeroporto, a viajem no avião, e conhecer toda uma cultura nova, num país novo com vistas novas e comídas novas.",
    "So far, I haven't traveled to many places, but I have several photographs of where I've been, and I'm definitely going to see the whole world when I start having my own money.": "Até hoje não viajei para muitos lugares, mas tenho várias fotografias de onde fui, e com certeza vou conhecer o mundo todo quando começar a ter o meu dinheiro.",

    "End": "Fim"
}